<h1 style="color:red">read_sql_query()</h1>

In [2]:
import pandas as pd

In [36]:
# !pip install mysql.connector         #This command installs a Python library that allows Python to talk to a MySQL database.
# !pip install sqlalchemy                # Install SQLAlchemy

In [37]:
# mysql-connector-python  ->  Library to connect Python with MySQL
# You install it once per Python environment, not per notebook. if your device doesn't have this environment
# for every notebook we will import mysql.connector to work on sql queries

In [38]:
import mysql.connector

<h2 style="color:blue">Connect to MySQL</h2>

In [18]:
conn = mysql.connector.connect(       # conn is a connection object, It represents a live communication channel
    host="localhost",                 # it tells Where MySQL is running, if running locally -> localhost is used, for remote server -> pass database server IP address
    user="root",                      # MySQL login username, initially username=root
    password='',                      # MySQL password for that user, initially noting set
    database="world"                  # tell about Which database to use inside MySQL database
)

# XAMPP is a software package used to create a local web server environment on a computer.
# XAMPP is NOT the database, XAMPP is a TOOL that RUNS the database.
# Apache ->	Web server
# MySQL  ->	DATABASE SERVER    (turn them onn).
# then go to "http://localhost/phpmyadmin/"

# conn -> Hey Python, connect me to the MySQL database named 'world' that is running on my computer via XAMPP.

In [32]:
df = pd.read_sql_query("SELECT * from country",conn)   # passing two objthingsects : SQL query, connection object
display(df)
# df = pd.read_sql_query("SELECT * from country where Population > 100000",conn)   
# df = pd.read_sql_query("SELECT * from country where Continent LIKE 'Asia' ",conn)   
# df = pd.read_sql_query("SELECT * from country where Continent='Asia' ",conn)   
# df = pd.read_sql_query("SELECT Code, Name, Population, GNP from country",conn)

C:\Users\rupes\AppData\Local\Temp\ipykernel_22220\3954202375.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * from country",conn)   # passing two objthingsects : SQL query, connection object

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041.0,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000.0,NaN,Jugoslavija,Federal Republic,Vojislav Koštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729.0,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377.0,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951.0,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW

In [39]:
df2 = pd.read_sql_query("SELECT * from city", conn)

C:\Users\rupes\AppData\Local\Temp\ipykernel_22220\1811560551.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql_query("SELECT * from city", conn)

<h2 style="color:brown">Create SQLAlchemy engine (THIS replaces conn)</h2>

In [3]:
# Pandas prefer SQLAlchemy Because SQLAlchemy is a standard middle layer
# pandas  ->  SQLAlchemy (recommended)  -->  MySQL / PostgreSQL / SQLite / Oracle

from sqlalchemy import create_engine

In [4]:
engine = create_engine("mysql+mysqlconnector://root:@localhost/world")

In [52]:
df3 = pd.read_sql_query("SHOW TABLES", engine)
display(df3)

df4 = pd.read_sql_query("SELECT * from city", engine)
display(df4)
df4 = pd.read_sql_query("SELECT * from country", engine)
display(df4)
df4 = pd.read_sql_query("SELECT * from countrylanguage", engine)
df4

   Tables_in_world
0             city
1          country
2  countrylanguage

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041.0,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000.0,NaN,Jugoslavija,Federal Republic,Vojislav Koštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729.0,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377.0,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951.0,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW

    CountryCode    Language IsOfficial  Percentage
0           ABW       Dutch          T         5.3
1           ABW     English          F         9.5
2           ABW  Papiamento          F        76.7
3           ABW     Spanish          F         7.4
4           AFG     Balochi          F         0.9
..          ...         ...        ...         ...
979         ZMB      Tongan          F        11.0
980         ZWE     English          T         2.2
981         ZWE     Ndebele          F        16.2
982         ZWE      Nyanja          F         2.2
983         ZWE       Shona          F        72.1

[984 rows x 4 columns]

In [72]:
# both code results same output
# df5 = pd.read_sql_query("SELECT ID, Name, Population, Language from city JOIN countrylanguage cl ON city.CountryCode = cl.CountryCode", engine)
df5 = pd.read_sql_query("SELECT ID, Name, Population, Language from city INNER JOIN countrylanguage cl ON city.CountryCode = cl.CountryCode", engine)
display(df5)
# df5 = pd.read_sql_query("SELECT ID, Name, Population, Language from city LEFT JOIN countrylanguage cl ON city.CountryCode = cl.CountryCode", engine)

# df5 = pd.read_sql_query("SELECT ID, Name, Population, Language from city LEFT JOIN countrylanguage cl ON city.CountryCode = cl.CountryCode WHERE Population > 1000000", engine)

         ID      Name  Population    Language
0         1     Kabul     1780000     Balochi
1         1     Kabul     1780000        Dari
2         1     Kabul     1780000      Pashto
3         1     Kabul     1780000  Turkmenian
4         1     Kabul     1780000       Uzbek
...     ...       ...         ...         ...
30665  4077  Jabaliya      113901      Hebrew
30666  4078    Nablus      100231      Arabic
30667  4078    Nablus      100231      Hebrew
30668  4079     Rafah       92020      Arabic
30669  4079     Rafah       92020      Hebrew

[30670 rows x 4 columns]

<h1 style="color:red">Parameters</h1>

<h2 style="color:brown">index_col Parameter</h2>

In [75]:
# index_col :-  str or list of str, optional, default: None
# Column(s) to set as index(MultiIndex).

df6 = pd.read_sql_query("SELECT * FROM city", engine, index_col='ID')
df6.info()
df6

<class 'pandas.core.frame.DataFrame'>
Index: 4079 entries, 1 to 4079
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         4079 non-null   object
 1   CountryCode  4079 non-null   object
 2   District     4079 non-null   object
 3   Population   4079 non-null   int64
dtypes: int64(1), object(3)
memory usage: 159.3+ KB

                Name CountryCode       District  Population
ID
1              Kabul         AFG          Kabol     1780000
2           Qandahar         AFG       Qandahar      237500
3              Herat         AFG          Herat      186800
4     Mazar-e-Sharif         AFG          Balkh      127800
5          Amsterdam         NLD  Noord-Holland      731200
...              ...         ...            ...         ...
4075      Khan Yunis         PSE     Khan Yunis      123175
4076          Hebron         PSE         Hebron      119401
4077        Jabaliya         PSE     North Gaza      113901
4078          Nablus         PSE         Nablus      100231
4079           Rafah         PSE          Rafah       92020

[4079 rows x 4 columns]

<h2 style="color:brown">params Parameter</h2>

In [14]:
# To safely pass values into SQL queries  (prevents SQL injection)

# BAD way ❌ (Never do this)
# city = "Delhi"
# sql = "SELECT * FROM city WHERE name = '{city}'"

# GOOD way ✅ (params)
sql = "SELECT * FROM city WHERE CountryCode = %s"
df7 = pd.read_sql_query(sql, engine, params=("IND",))
display(df7)

# Dictionary-style params
sql2 = "SELECT * FROM city WHERE CountryCode = %(cntCode)s AND Population > %(popCnt)s ORDER by Population DESC"
df7 = pd.read_sql_query(sql2, engine, params={"cntCode":"IND", 'popCnt':'1000000'})
display(df7)

       ID                Name CountryCode        District  Population
0    1024     Mumbai (Bombay)         IND     Maharashtra    10500000
1    1025               Delhi         IND           Delhi     7206704
2    1026  Calcutta [Kolkata]         IND    West Bengali     4399819
3    1027    Chennai (Madras)         IND      Tamil Nadu     3841396
4    1028           Hyderabad         IND  Andhra Pradesh     2964638
..    ...                 ...         ...             ...         ...
336  1360        Ambala Sadar         IND         Haryana       90712
337  1361          Baidyabati         IND    West Bengali       90601
338  1362               Morvi         IND         Gujarat       90357
339  1363             Raigarh         IND     Chhatisgarh       89166
340  1364            Vejalpur         IND         Gujarat       89053

[341 rows x 5 columns]

      ID                Name CountryCode        District  Population
0   1024     Mumbai (Bombay)         IND     Maharashtra    10500000
1   1025               Delhi         IND           Delhi     7206704
2   1026  Calcutta [Kolkata]         IND    West Bengali     4399819
3   1027    Chennai (Madras)         IND      Tamil Nadu     3841396
4   1028           Hyderabad         IND  Andhra Pradesh     2964638
5   1029           Ahmedabad         IND         Gujarat     2876710
6   1030           Bangalore         IND       Karnataka     2660088
7   1031              Kanpur         IND   Uttar Pradesh     1874409
8   1032              Nagpur         IND     Maharashtra     1624752
9   1033             Lucknow         IND   Uttar Pradesh     1619115
10  1034                Pune         IND     Maharashtra     1566651
11  1035               Surat         IND         Gujarat     1498817
12  1036              Jaipur         IND       Rajasthan     1458483
13  1037              Indore         IND  Madhya Pradesh     1091674
14  1038              Bhopal         IND  Madhya Pradesh     1062771
15  1039            Ludhiana         IND          Punjab     1042740
16  1040   Vadodara (Baroda)         IND         Gujarat     1031346
17  1041              Kalyan         IND     Maharashtra     1014557

<h2 style="color:brown">parse_dates Parameter</h2>

In [ ]:
# parse_dates (list or dict): 
# Databases often return dates as strings or integers, not real datetime objects.

# df8 = pd.read_sql_query("SELECT * FROM country", engine, parse_dates=["date"])     # let's say country have a date column

<h2 style="color:brown">chunksize Parameter</h2>

In [82]:
data = pd.read_sql_query(      # Instead of returning one big DataFrame, it returns an iterator of smaller DataFrames.
    "SELECT * FROM city",
    engine,
    chunksize=1000
)

for chunk in data:
    print(chunk.shape)

(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(79, 5)

<h2 style="color:brown">dtype Parameter</h2>

In [86]:
df9 = pd.read_sql_query(      # Instead of returning one big DataFrame, it returns an iterator of smaller DataFrames.
    "SELECT * FROM country",
    engine,
    dtype={"GNP":int}
)

df9.info()
display(df9)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239 entries, 0 to 238
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Code            239 non-null    object
 1   Name            239 non-null    object
 2   Continent       239 non-null    object
 3   Region          239 non-null    object
 4   SurfaceArea     239 non-null    float64
 5   IndepYear       192 non-null    float64
 6   Population      239 non-null    int64
 7   LifeExpectancy  222 non-null    float64
 8   GNP             239 non-null    int64
 9   GNPOld          178 non-null    float64
 10  LocalName       239 non-null    object
 11  GovernmentForm  239 non-null    object
 12  HeadOfState     238 non-null    object
 13  Capital         232 non-null    float64
 14  Code2           239 non-null    object
dtypes: float64(5), int64(2), object(8)
memory usage: 28.1+ KB

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
234,YEM,Yemen,Asia,Middle East,527968.0,1918.0,18112000,59.8,6041,5729.0,Al-Yaman,Republic,Ali Abdallah Salih,1780.0,YE
235,YUG,Yugoslavia,Europe,Southern Europe,102173.0,1918.0,10640000,72.4,17000,NaN,Jugoslavija,Federal Republic,Vojislav Koštunica,1792.0,YU
236,ZAF,South Africa,Africa,Southern Africa,1221037.0,1910.0,40377000,51.1,116729,129092.0,South Africa,Republic,Thabo Mbeki,716.0,ZA
237,ZMB,Zambia,Africa,Eastern Africa,752618.0,1964.0,9169000,37.2,3377,3922.0,Zambia,Republic,Frederick Chiluba,3162.0,ZM
238,ZWE,Zimbabwe,Africa,Eastern Africa,390757.0,1980.0,11669000,37.8,5951,8670.0,Zimbabwe,Republic,Robert G. Mugabe,4068.0,ZW